cases/flameletBuoyantSimpleSMOKE/Sandia_COH2N2/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 2 -2 0 0 0 0 ];

internalField   uniform -1.078418e+05;

boundaryField
{
    inletfuel           
    {
        type  		fixedValue;
	value		uniform -2.195775e+06;
    }

    inletair           
    {
        type  		fixedValue;
	value		$internalField;
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    sidewall       
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burnerwall
    {
        type  		zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
