cases/flameletBuoyantSimpleSMOKE/Sandia_COH2N2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    inletfuel
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0003206;
        phi             phi;
        k               k;
        value           uniform 3.337e+06;
    }
    inletair
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.021;
        phi             phi;
        k               k;
        value           uniform 0.00041;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    sidewall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    burnerwall
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
