cases/flameletBuoyantSimpleSMOKE/Sandia_COH2N2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
	solver           	GAMG;
        tolerance        	1e-7;
        relTol           	0.01;
        smoother         	DICGaussSeidel;
        cacheAgglomeration 	true;
        nCellsInCoarsestLevel 	10;
        agglomerator     	faceAreaPair;
        mergeLevels      	1;
/*
        solver         	 	GAMG;
        tolerance       	1e-10;
        relTol          	0.05;
        smoother        	GaussSeidel;
        cacheAgglomeration	off;
        nCellsInCoarsestLevel 	20;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
*/
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
	minIter		1;
    }

    "(k|epsilon|omega|H|Z|Zvar)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
	minIter		1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell                 0;
    pRefValue                0;

    rhoMin          rhoMin [ 1 -3  0 0 0 ] 0.02;
    rhoMax          rhoMax [ 1 -3  0 0 0 ] 3.00;
    pMin	    pMin   [ 1 -1 -2 0 0 ] 1e4;

    residualControl
    {
	default         1e-16;

        p_rgh           1e-16;
        U               1e-16;
        H               1e-16;
        k               1e-16;
        epsilon         1e-16;
        omega           1e-16;
	Z		1e-16;
	Zvar		1e-16;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.1;
        rho             0.1;
    }

    equations
    {
        default         0.3;

        U               0.3;
	Z		0.3;
	Zvar		0.3;
	H		0.3;
        k               0.3;
	epsilon         0.3;
        omega           0.3;
    }
}


// ************************************************************************* //
